#Варіант № 13. Створити текстовий файл. Замінити кожну другу літеру з кожного третього слова на будь-який символ.
# Зберегти 2 файли: з вихідними даними та зі зміненими.

#Text_File.txt - файл із вхідними даними (Там текст)
#New_Text.txt - файл із зміненими даними

N = 2 # покажчик заміни на певному символі слова
W = 3 # покажчик заміни на певному слові (у нашому випадку 3-му)

K = '#' # символ на який заміняють

new_text = "" #Текст, який буде додано в новий файл


#Зчитування інформації з файлу та її обробка згідно умови завдання
with open("Text_file.txt", "r") as f:
    i = 0 # покажчик на слово в тексті

    for line in f: # Зчитуємо по лініях
        for word in line.split(): # зчитуємо "по-слівно"
            i = i + 1 # Збільшення покажчика
            if i % W == 0: # Перевірка позиції слова

                # алгоритм заміни букв у 3-х словах
                for idx, ele in enumerate(word):
                    if idx % N == 1 and idx != 0:
                        new_text = new_text + K
                    else:
                        new_text = new_text + ele
                new_text += " "

            else:
                new_text += word + ' '
        new_text += '\n' # Після зчитування лінії переходимо на нову

with open("New_Text.txt", "w") as f: # створюємо файл із в якому зберігатимемо зміненні дані
    f.writelines(new_text) #записуємо змінений текст в файл з переносами


# Виведемо вмісти файлів на консоль

print("Вміст файлу Text_File.txt:")
with open("Text_file.txt", "r") as f:
    print(f.read())
print("\n")

print("Вміст файлу New_Text.txt:")
with open("New_Text.txt", "r") as f:
    print(f.read())
